AsyncProgramming/BenchmarkSyncAsyncTest/bank/reports/sync-no-latency.out
____________________________________________________________
TEST with 1 threads on http://localhost:8080/sync/bank-report/1
____________________________________________________________
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /sync/bank-report/1
Document Length:        136 bytes

Concurrency Level:      1
Time taken for tests:   19.821 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      2550000 bytes
HTML transferred:       1360000 bytes
Requests per second:    504.52 [#/sec] (mean)
Time per request:       1.982 [ms] (mean)
Time per request:       1.982 [ms] (mean, across all concurrent requests)
Transfer rate:          125.64 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       2
Processing:     1    2   1.6      2     117
Waiting:        0    2   1.5      1     116
Total:          1    2   1.6      2     117

Percentage of the requests served within a certain time (ms)
  50%      2
  66%      2
  75%      2
  80%      2
  90%      3
  95%      4
  98%      5
  99%      6
 100%    117 (longest request)
____________________________________________________________
TEST with 5 threads on http://localhost:8080/sync/bank-report/1
____________________________________________________________
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /sync/bank-report/1
Document Length:        136 bytes

Concurrency Level:      5
Time taken for tests:   6.031 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      2550000 bytes
HTML transferred:       1360000 bytes
Requests per second:    1658.07 [#/sec] (mean)
Time per request:       3.016 [ms] (mean)
Time per request:       0.603 [ms] (mean, across all concurrent requests)
Transfer rate:          412.90 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       8
Processing:     1    3   1.7      2      33
Waiting:        0    3   1.6      2      32
Total:          1    3   1.7      3      34

Percentage of the requests served within a certain time (ms)
  50%      3
  66%      3
  75%      3
  80%      4
  90%      4
  95%      6
  98%      8
  99%     10
 100%     34 (longest request)
____________________________________________________________
TEST with 10 threads on http://localhost:8080/sync/bank-report/1
____________________________________________________________
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /sync/bank-report/1
Document Length:        136 bytes

Concurrency Level:      10
Time taken for tests:   5.314 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      2550000 bytes
HTML transferred:       1360000 bytes
Requests per second:    1881.86 [#/sec] (mean)
Time per request:       5.314 [ms] (mean)
Time per request:       0.531 [ms] (mean, across all concurrent requests)
Transfer rate:          468.63 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.6      0       8
Processing:     1    5   2.6      4      46
Waiting:        0    4   2.5      4      46
Total:          1    5   2.6      5      47
WARNING: The median and mean for the initial connection time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%      5
  66%      5
  75%      6
  80%      7
  90%      8
  95%     10
  98%     12
  99%     15
 100%     47 (longest request)
____________________________________________________________
TEST with 20 threads on http://localhost:8080/sync/bank-report/1
____________________________________________________________
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /sync/bank-report/1
Document Length:        136 bytes

Concurrency Level:      20
Time taken for tests:   4.562 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      2550000 bytes
HTML transferred:       1360000 bytes
Requests per second:    2192.17 [#/sec] (mean)
Time per request:       9.123 [ms] (mean)
Time per request:       0.456 [ms] (mean, across all concurrent requests)
Transfer rate:          545.90 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.1      1      11
Processing:     1    8   4.6      7     120
Waiting:        0    7   4.5      6     119
Total:          2    9   4.6      8     122

Percentage of the requests served within a certain time (ms)
  50%      8
  66%      9
  75%     10
  80%     11
  90%     14
  95%     16
  98%     19
  99%     22
 100%    122 (longest request)
____________________________________________________________
TEST with 50 threads on http://localhost:8080/sync/bank-report/1
____________________________________________________________
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /sync/bank-report/1
Document Length:        136 bytes

Concurrency Level:      50
Time taken for tests:   4.560 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      2550000 bytes
HTML transferred:       1360000 bytes
Requests per second:    2192.77 [#/sec] (mean)
Time per request:       22.802 [ms] (mean)
Time per request:       0.456 [ms] (mean, across all concurrent requests)
Transfer rate:          546.05 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   3.0      2      37
Processing:     1   20  11.1     19     143
Waiting:        1   17  10.6     16     143
Total:          3   23  10.8     21     148

Percentage of the requests served within a certain time (ms)
  50%     21
  66%     24
  75%     27
  80%     29
  90%     35
  95%     42
  98%     55
  99%     60
 100%    148 (longest request)
____________________________________________________________
TEST with 100 threads on http://localhost:8080/sync/bank-report/1
____________________________________________________________
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /sync/bank-report/1
Document Length:        136 bytes

Concurrency Level:      100
Time taken for tests:   4.442 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      2550000 bytes
HTML transferred:       1360000 bytes
Requests per second:    2251.45 [#/sec] (mean)
Time per request:       44.416 [ms] (mean)
Time per request:       0.444 [ms] (mean, across all concurrent requests)
Transfer rate:          560.66 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    6   6.1      4      35
Processing:     3   38  19.7     36     178
Waiting:        2   33  18.7     31     177
Total:          6   44  18.4     42     185

Percentage of the requests served within a certain time (ms)
  50%     42
  66%     48
  75%     54
  80%     57
  90%     67
  95%     77
  98%     92
  99%    105
 100%    185 (longest request)
____________________________________________________________
TEST with 500 threads on http://localhost:8080/sync/bank-report/1
____________________________________________________________
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /sync/bank-report/1
Document Length:        136 bytes

Concurrency Level:      500
Time taken for tests:   4.470 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      2550000 bytes
HTML transferred:       1360000 bytes
Requests per second:    2237.28 [#/sec] (mean)
Time per request:       223.486 [ms] (mean)
Time per request:       0.447 [ms] (mean, across all concurrent requests)
Transfer rate:          557.13 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   67 196.5     23    1122
Processing:     6  151  80.3    139     525
Waiting:        6  134  79.0    121     521
Total:         14  218 212.6    182    1487

Percentage of the requests served within a certain time (ms)
  50%    182
  66%    213
  75%    231
  80%    244
  90%    310
  95%    354
  98%   1227
  99%   1259
 100%   1487 (longest request)
____________________________________________________________
TEST with 1000 threads on http://localhost:8080/sync/bank-report/1
____________________________________________________________
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /sync/bank-report/1
Document Length:        136 bytes

Concurrency Level:      1000
Time taken for tests:   5.044 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      2550000 bytes
HTML transferred:       1360000 bytes
Requests per second:    1982.64 [#/sec] (mean)
Time per request:       504.377 [ms] (mean)
Time per request:       0.504 [ms] (mean, across all concurrent requests)
Transfer rate:          493.72 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0  191 347.9     59    1159
Processing:    11  187 109.1    158    1062
Waiting:       11  161 102.6    135    1062
Total:         36  378 353.7    247    1483

Percentage of the requests served within a certain time (ms)
  50%    247
  66%    307
  75%    360
  80%    427
  90%   1202
  95%   1253
  98%   1337
  99%   1372
 100%   1483 (longest request)